# GetTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinition..::..GetTypeId Method
InternalDefinition Class See Also
---
Gets the identifier of the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ForgeTypeId GetTypeId()
```

Visual Basic
---
```text
Public Function GetTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetTypeId()
```

# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace